artillery.yml
config:
  target: 'http://localhost:7878'
  phases:
    - duration: 60
      arrivalRate: 25
  variables:
    companyAbbr:
      - ["AAAAA", "AAAAB", "AAAAC"]
      - ["AAAAD", "AAAAE", "AAAAF"]
scenarios:
  - flow:
    - loop:
      - get:
          url: "/{{ $loopElement }}"
      over: companyAbbr